# Ajay Kumar K P                                                     email: ajoctober06@gmail.com

# Assignment-03 Hypothesis Testing

# Q.1

In [48]:
import pandas as pd 
import numpy as np
import scipy 
from scipy import stats

In [49]:
data = pd.read_csv('Downloads\\Cutlets.csv')

In [50]:
data.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [51]:
data.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [52]:
data.mean()

Unit A    7.019091
Unit B    6.964297
dtype: float64

In [53]:
stats.ttest_ind(data['Unit A'],data['Unit B'])

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [56]:
# significane value is 5% and p_value is 47%
# Since P_value is greater than significance value 
'''null hypothesis is true'
  no difference in the diameter of the cutlet between the two units'''

"null hypothesis is true'\n  no difference in the diameter of the cutlet between the two units"

# Q.2

In [42]:
import scipy.stats as sts

In [43]:
lt = pd.read_csv('Downloads\\LabTAT.csv')

In [44]:
lt.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [45]:
lt.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [46]:
stats.f_oneway(lt.iloc[:,0], lt.iloc[:,1],lt.iloc[:,2], lt.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [47]:
p_value= 2.1156708949992414e-57
alpha0=0.05
print('significance=%.2f, p=%.2f' %(alpha0, p_value))
if p_value <= alpha0:
    print('there is difference in average TAT among the different laboratories & reject the null hyopthesis ')
else:
    print('there is no difference in average TAT among the different laboratories & accept the null hypothesis')

significance=0.05, p=0.00
there is difference in average TAT among the different laboratories & reject the null hyopthesis

# Q.3

In [33]:
br= pd.read_csv('Downloads\\BuyerRatio.csv')

In [34]:
br.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [35]:
a=br.iloc[:1,1:],br.iloc[1:,1:]
a

(   East  West  North  South
 0    50   142    131     70,
    East  West  North  South
 1   435  1523   1356    750)

In [36]:
from scipy.stats import chi2_contingency

In [40]:
b=chi2_contingency(a)
b

(1.595945538661058,
 0.6603094907091882,
 3,
 array([[[  42.76531299,  146.81287862,  131.11756787,   72.30424052]],

        [[ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]]))

In [41]:
if b[1] <= 0.05:
    print('reject H0')
else:
    print('fail to reject H0')

fail to reject H0

# Q.4

In [17]:
Cof=pd.read_csv('Downloads\\Costomer+OrderForm.csv')

In [18]:
Cof.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [19]:
Cof.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [20]:
Cof.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [21]:
Cof.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [22]:
Cof.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [26]:
cof_new = pd.DataFrame()
cof_new['Error free']=[271,267,269,280]
cof_new['Defective']=[29,33,31,20]

In [27]:
cof_new=cof_new.T
cof_new

              0    1    2    3
Error free  271  267  269  280
Defective    29   33   31   20

In [28]:
dt=[cof_new.iloc[:1]],[cof_new.iloc[1:]]
dt

([              0    1    2    3
  Error free  271  267  269  280],
 [            0   1   2   3
  Defective  29  33  31  20])

In [31]:
d=chi2_contingency(dt)
d

(3.858960685820355,
 0.2771020991233135,
 3,
 array([[[[271.75, 271.75, 271.75, 271.75]]],


        [[[ 28.25,  28.25,  28.25,  28.25]]]]))

In [32]:
if d[1] <= 0.05:
    print('reject H0')
else:
    print('fail to reject H0')

fail to reject H0